In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [2]:
# You can take unique values from the columns using the .unique operation
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [3]:
# To only get the number of unique values use .nunique()
df['col2'].nunique()

3

In [4]:
# If you want a table of the unique values and their modes use .value_counts
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [6]:
#conditional selection
df[(df['col1']>1) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

## The Apply method: a way of using functions on your data

In [7]:
# First makes a function
def times2(x):
    return x*2

In [8]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [24]:
# You can also do this with lambda functions
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [10]:
# You can do the same with built in python functions
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [11]:
df['col1'].sum()

10

In [15]:
# You can permanently remove a column with the del function
del df['col1']

In [14]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [16]:
# Getting column names and index numbers
df.columns

Index(['col2', 'col3'], dtype='object')

In [17]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [22]:
# You can check for null values using the isnull method and drop row with them using dropna
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [21]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [25]:
# use fillna to fill in NaN values
import numpy as np

In [26]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [30]:
df.fillna('FILL',inplace = True)# inplace set to False buy default

In [31]:
df

   col1   col2 col3
0   1.0   FILL  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  FILL  444.0  xyz

## Pivot Table creation

In [41]:
# We can create a pivot table out of a data frame
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [42]:
df.pivot_table(values ='D', index = ['A','B'],columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [43]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1